Tekla Open API Reference for Tekla Structures 2025
Polygon Constructor
Overload List
Name | Description
Polygon(ViewBase, PointList)
 Creates a new polygon instance with the point list using standard attributes.
Polygon(ViewBase, PointList, Polygon.PolygonAttributes)
 Creates a new polygon instance with the point list using the given attributes.
Top
See Also
Reference
Polygon Class
Tekla.Structures.Drawing Namespace